# Просим пользователя ввести число
number = input("Введите число от 0 до 99: ") #ввод строки, т.к. могут по ошибке ввести не цифру, а букву и т.д.
# Списки для единиц от 0 до 9, чисел 10-19 и десятков от 20 до 90
units = ["ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
teens = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать",
         "пятнадцать", "шестнадцать", "семнадцать", "восемьнадцать", "девятнадцать"]
tens  = ["", "", "двадцать", "тридцать", "сорок", "пятьдесят",
         "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
# Проверяем, что введено корректное число от 0 до 99, а не отрицательное число, буквы и т.д.
# isdigit() — это встроенный метод строки в Python, который проверяет, состоит ли строка только из цифр.
if number.isdigit() and 0 <= int(number) <= 99:
    n = int(number) #превращаем введенную строку и цифру

    if n < 10: #проверка однозначных чисел от 0 до 9. Берём слово из списка units по индексу n. если n = 0, то units[0] = "ноль",
#n = 7, то units[7] = "семь". 
        print(units[n])
    elif n < 20: #проверка чисел от 10 до 19. В списке teens они лежат по индексам 0..9, поэтому вычитаем 10, чтобы получить нужный индекс.
#если n = 10, то teens[0] = "десять", n = 13, teens[3] = "тринадцать".
        print(teens[n - 10])
    else: # проверка чисел от 20 до 99.Такие числа (если не оканчиваются на 0) состоят из двух частей: десятков и единиц. 
        tens_word = tens[n // 10] #n // 10 — целочисленное деление на 10 даёт цифру десятков. По этой цифре берём слово из списка tens. 
# В tens индексы 0 и 1 пустые ("") — они не используются,так как случай n < 20 мы уже рассмотрели выше, нули и десятки поэтому пусты, 
# они есть в units и teens.
        units_word = units[n % 10] #n % 10 — остаток от деления на 10, даёт цифру единиц. По этой цифре берём слово из списка units.
        if n % 10 == 0: #Если число круглое, оканчивается на 0, то единиц нет, выводятся только десятки.
            print(tens_word)
        else:
            print(tens_word + " " + units_word) # Иначе выводим "десяток + пробел + единица".
            
else:
    # Если введено что-то другое (буквы, пустая строка, отрицательные числа, числа больше 99)
    print("Ошибка: введите число от 0 до 99!")
