import math
peel = 5 #толщина кожуры апельсина в мм
density = 0.00104 #плотность мякоти апельсина в г/мм3
circule = float((input)('Измерьте длину окружности апельсина и запишите её в мм:'))
radius = circule/(2*math.pi) #расчет радиуса апельсина 
volume_mm = (4*math.pi*(radius)**3)/3-(4*math.pi*(radius-peel)**3)/3 #расчет объема мякоти апельсина в мм3
volume_g = volume_mm*0.00104 #объем в г
print ('Объём мякоти апельсина равен', round(volume_g), 'грамма(граммов)') #округление граммов мякоти апельсина до целого числа